modules_cxf_src_test_java_org_mule_module_cxf_issues_ProxyMule6829TestCase.java/[CN]/ProxyMule6829TestCase/[MT]/testProxyServerSoap12()/body

{
  final Latch latch=new Latch();
  TestCxfEventCallback testCxfEventCallback=new TestCxfEventCallback(latch);
  FunctionalTestComponent testComponent=(FunctionalTestComponent)getComponent("soap12Flow");
  testComponent.setEventCallback(testCxfEventCallback);
  String msgEchoOperation1="<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:new=\"http://new.webservice.namespace\">" + "<soap:Header/>" + "  <soap:Body>"+ "    <new:parameter1>hello world</new:parameter1>"+ "  </soap:Body>"+ "</soap:Envelope>";
  String msgEchoOperation2="<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:new=\"http://new.webservice.namespace\">" + "<soap:Header/>" + "  <soap:Body>"+ "    <new:parameter2>hello world</new:parameter2>"+ "  </soap:Body>"+ "</soap:Envelope>";
  String soapOperation="EchoOperation1";
  MuleMessage response=executeSoap12Call(msgEchoOperation1,soapOperation);
  assertTrue(latch.await(1000,TimeUnit.MILLISECONDS));
  String cxfOperationName=testCxfEventCallback.getCxfOperationName();
  assertEquals(soapOperation,cxfOperationName);
  assertTrue(getPayloadAsString(response).contains("<new:parameter1"));
  assertTrue(getPayloadAsString(response).contains("hello world"));
  soapOperation="EchoOperation2";
  response=executeSoap12Call(msgEchoOperation2,soapOperation);
  assertTrue(latch.await(1000,TimeUnit.MILLISECONDS));
  cxfOperationName=testCxfEventCallback.getCxfOperationName();
  assertEquals(soapOperation,cxfOperationName);
  assertTrue(getPayloadAsString(response).contains("<new:parameter2"));
  assertTrue(getPayloadAsString(response).contains("hello world"));
}
